#include<stdio.h>
#include<math.h> 
int main(void)
{
	float a[2][5][5]={0};						//放5*5的元素  a[0][5][5]放上次迭代的值，a[1][5][5]放当前迭代的值 
	int i,j,k=1;
	a[0][1][1]=a[0][2][1]=a[0][3][1]=25;		//初始化中间3*3元素的值 
	a[0][1][2]=a[0][2][2]=a[0][3][2]=50;
	a[0][1][3]=a[0][2][3]=a[0][3][3]=75;
	for(i=0;i<2;i++)
		a[i][1][4]=a[i][2][4]=a[i][3][4]=100;	//初始化最上面一行的值 
	while(1)
	{
		printf("迭代%d次：\n",k++);
		for(i=1;i<=3;i++)						//计算中间3*3的元素值 
		{
			for(j=1;j<=3;j++)
				a[1][i][j]=0.25*(a[0][i-1][j]+a[0][i+1][j]+a[0][i][j-1]+a[0][i][j+1]);	//公式3.7.10 
		}
		
		if(fabs(a[1][1][1]-a[0][1][1])<0.001&&fabs(a[1][1][2]-a[0][1][2])<0.001
		&&fabs(a[1][1][3]-a[0][1][3])<0.001&&fabs(a[1][2][1]-a[0][2][1])<0.001
		&&fabs(a[1][2][2]-a[0][2][2])<0.001&&fabs(a[1][2][3]-a[0][2][3])<0.001
		&&fabs(a[1][3][1]-a[0][3][1])<0.001&&fabs(a[1][3][2]-a[0][3][2])<0.001
		&&fabs(a[1][3][3]-a[0][3][3])<0.001)	//判断是否达到终止条件 
			break;
			
		for(i=1;i<=3;i++)
		{
			for(j=1;j<=3;j++)
			{
				a[0][i][j]=a[1][i][j];			//将这次迭代计算的值赋给a[0][5][5]，作为下次迭代使用 
			}
		}
		
	}
	printf("导数第二次的结果:\n"); 				//输出最后2次的结果 
	for(i=1;i<=3;i++)
	{
		for(j=1;j<=3;j++)
		{
			printf("%f  ",a[0][j][i]);
		}
		printf("\n");
	}
	printf("最后一次的结果:\n");
	for(i=1;i<=3;i++)
	{
		for(j=1;j<=3;j++)
		{
			printf("%f  ",a[1][j][i]);
		}
		printf("\n");
	}
	return 0;
}
